class PassportGame {
	constructor(args = {points: 0, menPhotos: [], womenPhotos: [], pointsTarget: 1000}) {
		this._points = args.points;
		this.pointsTarget = args.pointsTarget;
		this.entries = {
			upNumber:	{value: "", attribute: "innerText"},
			downNumber:	{value: "", attribute: "innerText"},
			rDate:  	{value: "", attribute: "innerText"},
			surname:	{value: "", attribute: "innerText"},
			name:   	{value: "", attribute: "innerText"},
			lastname:	{value: "", attribute: "innerText"},
			sex:    	{value: "", attribute: "innerText"},
			birthDate:	{value: "", attribute: "innerText"},
			photo:  	{value: "", attribute: "src"}
		};
		this[this.sex[1]] = args.menPhotos;
		this[this.sex[0]] = args.womenPhotos;
		this.fraud = false;
		this.status = {
			upNumber:	true,
			downNumber: true,
			rDate:      true,
			surname:    true,
			name:   	true,
			lastname:   true,
			sex:    	true,
			birthDate:	true,
		};
		this.errorsTotal = 0;
		this.checked = true;
		this.firstCircle = true;
		this.passports = 0;
	}
	
	generate( ) {
		let 
			entries = this.entries,
			FIO
		;
		if (!this.checked) return false;

		entries.sex = {value: this.sex[this.randNum({min:0, max:1})], attribute: "innerText"};
		[entries.surname.value, entries.name.value, entries.lastname.value] = this.names[entries.sex.value][this.randNum({min:0, max: this.names[entries.sex.value].length - 1})].split(" ");
		[entries.surname.attribute, entries.surname.attribute, entries.surname.attribute] = ["innerText", "innerText", "innerText"];

		entries.upNumber = {value: this._genPassNum(), attribute: "innerText"};
		entries.downNumber = entries.upNumber;
		entries.rDate = {value: this._genDate({min: 2005, max: 2017}), attribute: "innerText"};
		entries.birthDate = {value:this._genDate({min: 1960, max: 1990}), attribute: "innerText"};
		entries.photo = {value: this[entries.sex.value][this.randNum({min: 0, max: this[entries.sex.value].length - 1})], attribute: "src"};

		this.passports++;
		this.points += 100;	
		if(this.publish) this.publish("generated", {value: Object.assign({}, this.entries), target: this});
	}
	
	check() {
		let elements = Object.assign({}, document.querySelectorAll("*[id*='Input'")), element, radioElement = document.querySelector("*[name*='Input']:checked"), errors = 0;
		for (let key in elements) {
			element = elements[key];
			if (element.type === "text") {
				if ((element.value.toUpperCase().trim() != this.entries[element.id.slice(0, -5)].value.toUpperCase().trim()) && ! /11/.test(element.value)) {
					element.classList.add("error");
					this.status[[element.id.slice(0, -5)]] = false;
				} else {
					element.classList.remove("error");
					this.status[[element.id.slice(0, -5)]] = true;
				}
			}
		}
		
		if ( radioElement === null ) {
			this.status[document.querySelector("input[type='radio'][name*='Input']").name.slice(0, -5)] = false;
			document.querySelector("input[type='radio'][name*='Input']").parentNode.parentNode.classList.add("error");
		} else if (radioElement.value != this.entries.sex.value) {
			this.status[radioElement.name.slice(0, -5)] = false;
			radioElement.parentNode.parentNode.classList.add("error");
		} else {
			this.status[document.querySelector("input[type='radio'][name*='Input']").name.slice(0, -5)] = true;
			radioElement.parentNode.parentNode.classList.remove("error");
		}
		
		for (let key in this.status) {
			if(!this.status[key]) errors++;
		}
		
		this.errorsTotal += errors;
		this.checked = errors === 0;
		
		if (this.firstCircle) {
			this.points -= errors * 15;
			if (this.publish && errors > 0) this.publish("hasErrors", {value: errors, target: this, points: -errors * 15});
			this.firstCircle = errors === 0;
		} else {
			this.points -= errors * 15;
			if (this.publish && errors > 0) this.publish("hasErrors", {value: errors, target: this, points: -errors * 15});
			this.firstCircle = false;
		}
	
		if (this.checked) {
			this._clearInputs();
			if (this.firstCircle && this.publish) this.publish("noErrors", {target: this});
			this.firstCircle = true;
		}
	}
	
	_clearInputs( ) {
		let elements = Object.assign({}, document.querySelectorAll("*[id*='Input'")),  radioElement = document.querySelector("*[name*='Input']:checked");
		for (let key in elements) {
			elements[key].value = "";
		}
		radioElement.checked = false;
	}
	
	_genDate(yearsLim = {min: 1960, max: 1990}) {
		return this.toLen(this.randNum({min: 1, max: 31}), 2) + "." + this.toLen(this.randNum({min: 1, max: 12}), 2) + "." + this.randNum({min: yearsLim.min, max: yearsLim.max});
	}
	
	_genPassNum() {
		return this.randNum({min:1000, max: 9999}) + " " + this.randNum({min:100000, max: 999999})
	}
	
	toLen(text, len) {
		let result = "";
		text = String(text);
		while (result.length + text.length < len) {
			result += "0";
		}
		return result + text;
	}
	
	randNum(lim = {min: 0, max: 100}) {
		let r = Math.random( );
		return lim.min + +( r * (lim.max - lim.min) ).toFixed(0);
	}
	
	get points() {
		return this._points;
	}
	
	set points(val) {
		val = val >= 0 ? val : 0;
		let difference = this._points - val;
		this._points = val;		
		
		if(difference < 0 && this.publish) this.publish("pointsGrow", {value: val - this._points, target: this});
		if(difference > 0 && this.publish) this.publish("pointsRegress", {value: val - this._points, target: this}); 

		if(this._points >= this.pointsTarget && this.publish)this.publish("gotTarget", {value: this._points, target: this}); 
	}
	
	get names() {
		return {
			"ЖЕН.":			[ "Фёдорова Анэля Мартыновна", "Кузьмина Дебора Данииловна", "Шарапова Альвина Парфеньевна", "Назарова Герда Ильяовна", "Игнатова Марианна Дмитриевна", "Галкина Мериса Григорьевна", "Быкова Эмма Максовна", "Потапова Агния Ростиславовна", "Виноградова Анжелика Богдановна", "Мамонтова Нина Тимофеевна", "Кудряшова Милда Ростиславовна", "Беляева Грета Денисовна", "Лихачёва Азалия Степановна", "Маркова Альбина Митрофановна", "Игнатьева Хильда Юрьевна", "Петрова Жюли Богдановна", "Колобова Азалия Андреевна", "Пахомова Юнона Ростиславовна", "Зимина Карина Владиславовна", "Лихачёва Лали Якуновна", "Ефимова Авигея Германновна", "Савина Зинаида Тарасовна", "Воронова Милолика Владленовна", "Нестерова Северина Максовна", "Рябова Кара Геннадьевна", "Бирюкова Мартина Владимировна", "Сафонова Данута Тимофеевна", "Бурова Береслава Протасьевна", "Титова Гера Демьяновна", "Кабанова Яна Куприяновна", "Трофимова Виргиния Дмитриевна", "Лаврентьева Нинна Денисовна", "Ермакова Влада Адольфовна", "Чернова Иветта Адольфовна", "Елисеева Ирма Лукьевна", "Зыкова Магдалина Митрофановна", "Князева Ольга Геласьевна", "Блинова Любава Семеновна", "Мухина Инара Якововна", "Николаева Ветта Филатовна", "Чернова Мелитта Онисимовна", "Никифорова Александра Лукьяновна", "Коновалова Альберта Антоновна", "Меркушева Илена Антониновна", "Жукова Томила Донатовна", "Журавлёва Влада Богуславовна", "Молчанова Амалия Вениаминовна", "Субботина Эльза Аркадьевна", "Соболева Даниэла Руслановна", "Соколова Мелиана Олеговна", "Григорьева Уля Георгиевна", "Боброва Устинья Митрофановна", "Зайцева Жаклин Наумовна", "Субботина Милослава Федотовна", "Молчанова Милда Алексеевна", "Субботина Лейла Станиславовна", "Бобылёва Вида Наумовна", "Логинова Бронислава Германовна", "Кузнецова Наталия Ивановна", "Носова Элла Ильяовна", "Иванова Милослава Леонидовна", "Филатова Сима Игоревна", "Шестакова Беатриса Филипповна", "Шарапова Магдалина Тимуровна", "Пономарёва Лиана Протасьевна", "Николаева Ирэна Руслановна", "Котова Мария Рудольфовна", "Пономарёва Анна Артемовна", "Исаева Лилу Ивановна", "Логинова Стелла Георгьевна", "Белозёрова Мария Евсеевна", "Воробьёва Роксалана Богдановна", "Гришина Моника Мироновна", "Белозёрова Белла Наумовна", "Сидорова Янита Альбертовна", "Назарова Диодора Наумовна", "Казакова Асида Евгеньевна", "Ефимова Марианна Дмитриевна", "Иванова Силика Робертовна", "Лобанова Анфиса Витальевна", "Овчинникова Мэри Якововна", "Романова Лейла Борисовна", "Лукина Хельга Данииловна", "Сысоева Стелла Мартыновна", "Рогова Ксения Иосифовна", "Турова Грета Артемовна", "Фадеева Василиса Христофоровна", "Шубина Симона Прокловна", "Хамина Дарья Никитична", "Вавилова Эвелина Антоновна", "Ащерина Виолетта Вячеславовна", "Мисюрёва Вера Глебовна", "Смольянинова Алина Николаевна", "Бычкова Мокрина Геннадьевна", "Щербатова Артемия Никитична", "Корсакова Юдифь Вадимовна", "Плохово Катерина Вадимовна", "Иевлева Татьяна Ростиславовна", "Меняева Янина Николаевна", "Якимова Георгина Даниловна", "Ададурова Елена Гаврииловна", "Ларионова Серафима Васильевна", "Малиновская Кира Борисовна", "Вальчицкая Беатриса Анатольевна", "Мельгунова Ванда Михайловна", "Лишина Рогнеда Владиславовна", "Велецкая Грета Сергеевна", "Харченко Агриппина Сергеевна", "Наумова Онисия Степановна", "Суковкина Веста Эдуардовна", "Чичагова Пульхерия Геннадьевна", "Вельяминова Соломония Игоревна", "Карандеева Зоя Васильевна", "Луцкевич Жозефина Аркадиевна", "Герасименко Руфь Антоновна", "Харченко Юдифь Владиславовна", "Галахова Глафира Владиславовна", "Королёва Ника Леонидовна", "Байкова Акилина Евгеньевна", "Ветчинина Степанида Дмитриевна", "Матссон Виолетта Теодоровна", "Викстрём Васса Акакиевна", "Юханссон Прасковья Авсеевна", "Окессон Евпраксия Касьяновна", "Перссон Радмила Киприановна", "Нильссон Карина Донатовна", "Виклунд Ариадна Кириаковна", "Сандстрём Розалия Мануйловна", "Сандстрём Георгина Сильвестровна", "Франссон Томила Северьяновна", "Лундстрём Галина Игнатьевна", "Оберг Поликсения Бонифатиевна", "Лундберг Алевтина Леопольдовна", "Юханссон Агафья Ефремовна", "Франссон Мелания Фокична", "Бюро Кикилия Корнелиевна", "Босежюр Домна Селивёрстовна", "Лефевр Поликсения Никитична", "Мартен Ванда Нефёдовна", "Леру Федора Власовна", "Ноле Кикилия Никитична", "Крото Юстина Елистратовна", "Дюшарм Нинель Феликсовна", "Туржон Лилия Христиановна", "Лакруа Исидора Климентовна", "Бланшар Алексина Теодоровна", "Лефевр Ярослава Сильвестровна", "Доре Ждана Сергеевна", "Ларок Руфь Братиславовна", "Оливье Ада Валерьяновна", "Дери Феофания Азариевна", "Лаперьер Настасья Евстафьевна", "Лефевр Иуста Терентьевна", "Мартен Макрина Аврамиевна", "Паре Виола Орестовна", "Лафонтен Ариадна Ангелиновна", "Ламонтань Серафима Анисимовна", "Робишо Фаина Ипатьевна", "Руссо Флавиана Евстафьевна", "Ру Виола Амосовна", "Рошетт Таисья Вадимовна", "Бутен Клеопатра Кузьминична", "Кантен Аграфена Борисовна", "Бланшар Синклитикия Даниловна", "Пеллерен Марьяна Эдмундовна", "Шампань Арсения Харлампиевна", "Буавер Ева Мавродиевна" ],
			"МУЖ.":			[ "Майер Лактион Капитонович", "Раске Ферапонт Зинонович", "Хауслер Акила Киприанович", "Байер Касьян Филаретович", "Зоммер Аетий Севастианович", "Поль Иерофей Аркадьевич", "Зауэр Еремей Маркович", "Шмидт Ефим Ануфриевич", "Кауфер Иезекииль Гориславович", "Тидеман Феофан Соломонович", "Лихтенберг Агапит Каллистратович", "Фогель Всеслав Орестович", "Хауслер Фока Нарциссович", "Фюрст Аверкий Маркович", "Вальц Авраам Каллистратович", "Вольф Евдоким Иерофеевич", "Фогт Орест Тихонович", "Фосс Евсевий Митрофанович", "Гроссер Бонифаций Никитич", "Вольф Юлиан Минич", "Гайер Федул Адонисович", "Колер Витольд Милославович", "Гербер Харисий Арсенович", "Нойман Кириак Клавдиевич", "Викнлер Петроний Велимирович", "Егер Досифей Андронович", "Винтер Аникита Валерианович", "Эггер Тимофей Егорович", "Бауэр Михей Варламович", "Хафнер Аввакум Филимонович", "Ройтер Лазарь Леонардович", "Брун Харсей Пантелеимонович", "Титов Назарий Авксентьевич", "Павлов Нисон Михаилович", "Тимофеев Мечеслав Геннадиевич", "Филатов Аверкий Валерьянович", "Зыков Иосиф Парфеньевич", "Шашков Василий Иванович", "Сидоров Максим Павлович", "Силин Устин Авксентьевич", "Маслов Евгений Святославович", "Герасимов Степан Кимович", "Денисов Захар Максович", "Семёнов Константин Мэлорович", "Маслов Игорь Дмитриевич", "Кабанов Ермолай Онисимович", "Рябов Прохор Денисович", "Агафонов Александр Валерьянович", "Горшков Прохор Якунович", "Игнатов Руслан Рудольфович", "Филатов Филипп Валерьевич", "Кулагин Нисон Германович", "Филатов Платон Викторович", "Кузнецов Виссарион Иосифович", "Федотов Авраам Егорович", "Панфилов Овидий Русланович", "Лобанов Дмитрий Антонинович", "Шаров Адам Тимофеевич", "Смирнов Альберт Платонович", "Третьяков Любомир Анатольевич", "Мышкин Рудольф Станиславович", "Силин Тарас Константинович", "Кузьмин Май Демьянович", "Рогов Емельян Данилович", "Жданов Илья Федорович", "Громов Степан Даниилович", "Гусев Ипполит Артёмович", "Цветков Савелий Максимович", "Шарапов Станислав Львович", "Самсонов Зиновий Антонинович", "Тимофеев Олег Наумович", "Власов Оскар Тимурович", "Агафонов Исаак Робертович", "Орехов Арсен Вениаминович", "Виноградов Богдан Русланович", "Тихонов Исак Тихонович", "Фролов Панкрат Артёмович", "Макаров Юрий Авксентьевич", "Тетерин Игнатий Иванович", "Волков Леонтий Оскарович", "Ситников Альфред Альбертович", "Доронин Аверкий Иванович", "Кононов Варлам Артёмович", "Белов Емельян Донатович", "Фёдоров Гурий Олегович", "Соколов Фрол Юлианович", "Романов Арсен Ярославович", "Федосеев Леонтий Рубенович", "Громов Севастьян Христофорович", "Зуев Григорий Дмитрьевич", "Блохин Платон Тимурович", "Ефимов Соломон Мэлсович", "Карпов Эдуард Митрофанович", "Никитин Аристарх Валерьевич", "Федотов Ярослав Федотович", "Соколов Степан Владиславович", "Гришин Иван Юрьевич", "Никифоров Аверкий Антонович", "Рябов Фрол Романович", "Дементьев Моисей Ярославович", "Евдокимов Демьян Вениаминович", "Капустин Дмитрий Аркадьевич", "Кабанов Митрофан Федосеевич", "Михеев Панкратий Львович", "Шестаков Парамон Антонович", "Потапов Альфред Эдуардович", "Михайлов Трофим Авксентьевич", "Дьячков Адольф Викторович", "Голубев Лев Робертович", "Киселёв Алексей Олегович", "Зуев Альфред Константинович", "Беспалов Ростислав Рубенович", "Тимофеев Корнелий Юрьевич", "Фомин Аскольд Денисович", "Зайцев Рудольф Иванович", "Дроздов Константин Авксентьевич", "Николаев Архип Максимович", "Данилов Кассиан Максович", "Потапов Августин Протасьевич", "Копылов Вилен Артемович", "Левин Флегонт Павлович", "Фишер Арис Богданович", "Финкельштейн Ермоген Алексеевич", "Янкелевич Алфей Данилович", "Перельман Сильвестр Кириллович", "Менакер Евграф Богданович", "Штейн Лонгин Васильевич", "Шапиро Абрам Матвеевич", "Розенталь Наум Аркадьевич", "Шустер Фома Русланович", "Рабин Сидор Сергеевич", "Шац Зиновий Александрович", "Мендель Перфилий Николаевич", "Розенталь Руслан Витальевич", "Дрекслер Михей Фёдорович", "Вольф Капитон Русланович", "Хейфиц Викторин Глебович", "Ашкенази Андриан Олегович", "Кацман Кирилл Максимович", "Вольф Святополк Иннокентьевич", "Гольдштейн Степан Кириллович", "Шустер Артемидор Дмитриевич", "Гиршович Касьян Александрович", "Клейн Эразм Вадимович", "Гиршман Кондрат Дмитриевич", "Зальцман Арефий Вадимович", "Козак Малахия Богданович", "Коган Лавр Михайлович", "Кауфман Гавриил Леонидович", "Цирульник Дмитрий Евгеньевич", "Бродский Артемидор Антонович", "Ройтман Петроний Евгеньевич", "Вольф Виталий Артёмович", "Айзенберг Бахрамей Иннокентьевич", "Френкель Владимир Даниилович", "Фукс Феодул Ростиславович", "Зальцман Марк Владимирович", "Мендель Аетий Валентинович", "Вульф Мамант Александрович", "Левин Семён Дмитриевич", "Кравец Аетий Фёдорович", "Козак Карп Эдуардович", "Фельдман Сидор Анатольевич", "Шварц Харлампий Артёмович", "Рабинович Анемподист Анатольевич", "Перельман Трифон Алексеевич", "Левитан Ермолай Андреевич" ],
		}
	}
	
	get sex() {
		return ["ЖЕН.", "МУЖ."]
	}
	
}
/*
let p = new PassportGame(0, data.menPhotos, data.womenPhotos);
p.generate();
console.log(p.entries)*/